console.group('js30#3.2-memory-game');
console.log(`Оценка своей работы "js30#3.2-memory-game" (60)
  ||  1. Вёрстка +10
  ||    - реализован интерфейс игры +5
  ||    - в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5
  ||    - адаптивная верстка
  ||
  ||  2. Карточки, по которым кликнул игрок, переворачиваются согласно правилам игры +10
  ||
  ||  3. Игра завершается, когда открыты все карточки +10
  ||
  ||  4. По окончанию игры выводится её результат - количество ходов, которые понадобились для завершения игры +10
  ||
  ||  5. Результаты последних 10 игр сохраняются в local storage. Есть таблица рекордов, в которой сохраняются результаты предыдущих 10 игр +10
  ||
  ||  6. По клику на карточку – она переворачивается плавно, если пара не совпадает – обе карточки так же плавно переварачиваются рубашкой вверх +10
  ||
  ||  7. Дополнительный функционал:
  ||    - 2 сложности на выбор (лучшие результаты сохраняются в разных таблицах)
  ||    - кнопка Reset - сбросить текущий прогресс
  ||    - при старте игры запускается таймер, отсчитывающий время (так же сохраняется в результатах)
  ||
`);
console.groupEnd();
